# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
ch: 6
nc: 1  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
   n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  #s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
   #m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
   #l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOP8s
   #x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

  # two stream backbone
  # Visible branch
  - [1, 1, Conv, [64, 3, 2]]  # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 4-P2/4
  - [-1, 3, C2f, [128, True]]
  # Infrared branch
  - [2, 1, Conv, [ 64, 3, 2 ] ]  # 6-P1/2
  - [-1, 1, Conv, [ 128, 3, 2 ] ]  # 7-P2/4
  - [-1, 3, C2f, [ 128, True ] ]

  - [5, 1, Conv, [256, 3, 2]]  # 9-P3/8-visible n:64
  - [8, 1, Conv, [256, 3, 2]]  # 10-P3/8-infrared n:64
  - [-2, 6, C2f, [256, True]]      # 11-P3/8 visible n:64
  - [-2, 6, C2f, [256, True]]      # 12-P3/8 infrared
  # 第一个CPCA模块
  - [[-2, -1], 1, CPCA_CF, [512, 256]]   # 13-P3/8 CPCA:Enhanced Features of visible branch with infrared branch N:64
  - [[-3, 13], 1, FeatureAdd, []]       # 14-P3/8 stream one vis+Enhanced Features n:32+64=96
  - [[-3, 13], 1, FeatureAdd, []]       # 15-P3/8 stream one inf+Enhanced Features n:32+64=96

  - [-2, 1, Conv, [512, 3, 2]]     # 16-P4/16 visible
  - [-2, 1, Conv, [512, 3, 2]]     # 17-P4/16 infrared
  - [-2, 6, C2f, [512, True]]      # 18-P4/16 visible
  - [-2, 6, C2f, [512, True]]      # 19-P4/16 infrared

    # 第二个CPCA模块
  - [[-2, -1], 1, CPCA_CF, [512, 256]]   # 20-P4/16 CPCA:Enhanced Features of visible branch with infrared branch
  - [[-3,20], 1, FeatureAdd, []]       # 21-P4/16 stream one vis+Enhanced Features
  - [[-3,20], 1, FeatureAdd, []]       # 22-P4/16 stream one inf+Enhanced Features

  - [-2, 1, Conv, [1024, 3, 2]]     # 23-P5/32 visible
  - [-2, 1, Conv, [1024, 3, 2]]     # 24-P5/32 infrared
  - [-2, 3, C2f, [1024, True]]      # 25-P5/32 visible
  - [-2, 3, C2f, [1024, True]]      # 26-P5/32 infrared
    # 第三个CPCA模块
  - [[-2, -1], 1, CPCA_CF, [2048, 1024]]   # 27-P5/32  CPCA:Enhanced Features of visible branch with infrared branch
  - [[-3,27], 1, FeatureAdd, []]       # 28-P5/32  stream one vis+Enhanced Features
  - [[-3,27], 1, FeatureAdd, []]       # 29-P5/32  stream one inf+Enhanced Features

  - [-2, 1, SPPF, [1024, 5]]     # 30-P5/32 visible n:128
  - [-2, 1, SPPF, [1024, 5]]     # 31-P5/32 infrared n:128

  - [[14, 15], 1, AlignedLocalMambaFusion, [256]]  # 32 local-global aligned fusion
  - [[21, 22], 1, AlignedLocalMambaFusion, [512]]  # 33
  - [[30, 31], 1, AlignedLocalMambaFusion, [1024]]  # 34


 # YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    #
  - [[-1, 33], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 37

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 32], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 40 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 37], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 43 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] #n:128
  - [[-1, 34], 1, Concat, [1]]  # cat head P5 n:256+128=384
  - [-1, 3, C2f, [1024]]  # 46 (P5/32-large) n:256

  - [[40, 43, 46], 1, Detect, [nc]]  # Detect(P3, P4, P5)
